org/doc/emacs-set.org
#+STARTUP: showall indent hidestars
#+HTML_HEAD: <!-- -*- mode: org; fill-column: 87 -*-  -->

#+HTML_DOCTYPE: <!DOCTYPE html>
#+HTML_HEAD: <link href="../css/style.css" rel="stylesheet" type="text/css" />

#+OPTIONS: toc:nil num:nil h:4 html-postamble:nil html-preamble:t tex:t f:t

#+TOC: headlines 3

#+HTML: <div class="outline-2" id="meta"><a href="../index.html">На главную</a></div>

#+TITLE: Руководство по кастомизации Emacs

* Интро

Сегодня мы установим в наш ~emacs~ все необходимое, начиная с
настоящего комбайна, который называтся ~Cedet~.

* Cedet

Пакет ~Cedet~ объединяет
в своем составе несколько пакетов, реализующих различную
функциональность, но объединенных вокруг одной задачи по работе с
исходным кодом на различных языках программирования.

** Инсталляция

Берем тарбол с официального репозитория
http://cedet.cvs.sourceforge.net/viewvc/cedet/ и распаковываем его в
~/.emacs.d/cedet

** Компиляция в Emacs-e

После этого заходим туда и отдаем команду

#+BEGIN_SRC sh
  emacs -Q -l cedet-build.el -f cedet-build
#+END_SRC

Таким нетривиальным образом, через emacs, оказывается можно собрать и
скомпилить cedet.

** Настройка

После завершения компиляции добавляем в init.el
следующие строки:

#+BEGIN_SRC lisp
;; Load CEDET.
;; See cedet/common/cedet.info for configuration details.
(load-file "~/.emacs.d/cedet/common/cedet.el")

;; Enable EDE (Project Management) features
(global-ede-mode 1)

;; Enable EDE for a pre-existing C++ project
;; (ede-cpp-root-project "NAME" :file "~/myproject/Makefile")

;; Enabling Semantic (code-parsing, smart completion) features
;; Select one of the following:

;; * This enables the database and idle reparse engines
(semantic-load-enable-minimum-features)

;; * This enables some tools useful for coding, such as summary mode
;;   imenu support, and the semantic navigator
(semantic-load-enable-code-helpers)

;; * This enables even more coding tools such as intellisense mode
;;   decoration mode, and stickyfunc mode (plus regular code helpers)
;; (semantic-load-enable-gaudy-code-helpers)

;; * This enables the use of Exuberent ctags if you have it installed.
;;   If you use C++ templates or boost, you should NOT enable it.
;; (semantic-load-enable-all-exuberent-ctags-support)
;;   Or, use one of these two types of support.
;;   Add support for new languges only via ctags.
;; (semantic-load-enable-primary-exuberent-ctags-support)
;;   Add support for using ctags as a backup parser.
;; (semantic-load-enable-secondary-exuberent-ctags-support)

;; Enable SRecode (Template management) minor-mode.
;; (global-srecode-minor-mode 1)

;; from yakor_spb@emacs.conference.jabber.ru
(semantic-load-enable-excessive-code-helpers)

;; Code Folding ; http://alexott-ru.blogspot.com/2009/01/blog-post.html
(defun my-semantic-hook ()
  (semantic-tag-folding-mode 1))
(add-hook 'semantic-init-hooks 'my-semantic-hook)
#+END_SRC

Теперь можно получить настоящее удовольствие при программировании!

* Emacs Code Browser

Добавляем в CEDET EmacsCodeBrowser, который превращает emacs в
многоязыковую IDE.

** Инсталляция


Берем снапшот из <a href="http://ecb.sourceforge.net/cvs_snapshots/ecb.tar.gz">официального
репозитория</a> и распаковываем в <code>~/.emacs.d/ecb</code>

** Конфигурирование

Добавляем в конфиграционный файл Емакса следующие строчки:

#+BEGIN_SRC sh
;; Load ECB
(add-to-list 'load-path "~/.emacs.d/ecb")
(require 'ecb-autoloads)
(global-set-key (kbd "C-x p") 'ecb-activate)
(global-set-key (kbd "C-x j") 'ecb-deactivate)
(global-set-key (kbd "C-x ,") 'ecb-toggle-ecb-windows)
(global-set-key (kbd "\e\eg") 'goto-line)
(global-set-key [?\M-g] 'goto-line)
(define-key global-map (kbd "C-<tab>") 'workspace-controller)
(setq ecb-tip-of-the-day nil)
(setq ecb-prescan-directories-for-emptyness nil)
#+END_SRC

После этого перезапускаем Емакс и даем команду <code>M-x ecb-byte-compile</code>,
которая ускорит загрузку нашей среды программирования.

Теперь, чтобы запустить ECB можно нажать <code>C-x p</code> А чтобы скрыть <code>C-x</code> ,
Ну а если вы хотите вообще выключить ECB - <code>C-x j</code> При желании вы можете настроить свои
комбинации клавиш.

Продуктивной работы!

