www/doc/emacs-set.html
<!DOCTYPE html>
<html>
<head>
<title>Руководство по кастомизации Emacs</title>
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="rigidus">
<link href="/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Руководство по кастомизации Emacs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Интро</a></li>
<li><a href="#sec-2">Cedet</a>
<ul>
<li><a href="#sec-2-1">Инсталляция</a></li>
<li><a href="#sec-2-2">Компиляция в Emacs-e</a></li>
<li><a href="#sec-2-3">Настройка</a></li>
</ul>
</li>
<li><a href="#sec-3">Emacs Code Browser</a>
<ul>
<li><a href="#sec-3-1">Инсталляция</a></li>
<li><a href="#sec-3-2">Конфигурирование</a></li>
</ul>
</li>
<li><a href="#sec-4">Color-theme</a></li>
<li><a href="#sec-5">Комментирование и поиск</a></li>
<li><a href="#sec-6">Cua-mode</a></li>
<li><a href="#sec-7">Emacs-Jabber</a>
<ul>
<li><a href="#sec-7-1">Инсталляция</a></li>
<li><a href="#sec-7-2">Настройка</a></li>
</ul>
</li>
<li><a href="#sec-8">Wanderlust.</a>
<ul>
<li><a href="#sec-8-1">Установка</a></li>
<li><a href="#sec-8-2">Конфигурирование</a></li>
</ul>
</li>
<li><a href="#sec-9">MailCrypt</a>
<ul>
<li><a href="#sec-9-1">Инсталляция</a></li>
<li><a href="#sec-9-2">Использование</a></li>
</ul>
</li>
<li><a href="#sec-10">lj-update</a></li>
<li><a href="#sec-11">MetaJump</a></li>
<li><a href="#sec-12">Мои мinor-режимы</a>
<ul>
<li><a href="#sec-12-1">Настройка</a></li>
</ul>
</li>
<li><a href="#sec-13">Русификация Емакса</a></li>
<li><a href="#sec-14">Полезные мелочи</a></li>
<li><a href="#sec-15">uniquify</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Интро</h2>
<div class="outline-text-2" id="text-1">
<p>
Сегодня мы установим в наш <code>emacs</code> все необходимое, начиная с
настоящего комбайна, который называтся <code>Cedet</code>.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Cedet</h2>
<div class="outline-text-2" id="text-2">
<p>
Пакет <code>Cedet</code> объединяет
в своем составе несколько пакетов, реализующих различную
функциональность, но объединенных вокруг одной задачи по работе с
исходным кодом на различных языках программирования.
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Инсталляция</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Берем тарбол с официального репозитория
<a href="http://cedet.cvs.sourceforge.net/viewvc/cedet/">http://cedet.cvs.sourceforge.net/viewvc/cedet/</a> и распаковываем его в
~/.emacs.d/cedet
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Компиляция в Emacs-e</h3>
<div class="outline-text-3" id="text-2-2">
<p>
После этого заходим туда и отдаем команду
</p>

<div class="org-src-container">

<pre class="src src-sh">emacs -Q -l cedet-build.el -f cedet-build
</pre>
</div>

<p>
Таким нетривиальным образом, через emacs, оказывается можно собрать и
скомпилить cedet.
</p>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">Настройка</h3>
<div class="outline-text-3" id="text-2-3">
<p>
После завершения компиляции добавляем в init.el
следующие строки:
</p>

<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">Load CEDET.</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">See cedet/common/cedet.info for configuration details.</span>
(load-file <span style="color: #8b2252;">"~/.emacs.d/cedet/common/cedet.el"</span>)

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Enable EDE (Project Management) features</span>
(global-ede-mode 1)

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Enable EDE for a pre-existing C++ project</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">(ede-cpp-root-project "NAME" :file "~/myproject/Makefile")</span>

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Enabling Semantic (code-parsing, smart completion) features</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Select one of the following:</span>

<span style="color: #b22222;">;; </span><span style="color: #b22222;">* This enables the database and idle reparse engines</span>
(semantic-load-enable-minimum-features)

<span style="color: #b22222;">;; </span><span style="color: #b22222;">* This enables some tools useful for coding, such as summary mode</span>
<span style="color: #b22222;">;;   </span><span style="color: #b22222;">imenu support, and the semantic navigator</span>
(semantic-load-enable-code-helpers)

<span style="color: #b22222;">;; </span><span style="color: #b22222;">* This enables even more coding tools such as intellisense mode</span>
<span style="color: #b22222;">;;   </span><span style="color: #b22222;">decoration mode, and stickyfunc mode (plus regular code helpers)</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">(semantic-load-enable-gaudy-code-helpers)</span>

<span style="color: #b22222;">;; </span><span style="color: #b22222;">* This enables the use of Exuberent ctags if you have it installed.</span>
<span style="color: #b22222;">;;   </span><span style="color: #b22222;">If you use C++ templates or boost, you should NOT enable it.</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">(semantic-load-enable-all-exuberent-ctags-support)</span>
<span style="color: #b22222;">;;   </span><span style="color: #b22222;">Or, use one of these two types of support.</span>
<span style="color: #b22222;">;;   </span><span style="color: #b22222;">Add support for new languges only via ctags.</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">(semantic-load-enable-primary-exuberent-ctags-support)</span>
<span style="color: #b22222;">;;   </span><span style="color: #b22222;">Add support for using ctags as a backup parser.</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">(semantic-load-enable-secondary-exuberent-ctags-support)</span>

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Enable SRecode (Template management) minor-mode.</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">(global-srecode-minor-mode 1)</span>

<span style="color: #b22222;">;; </span><span style="color: #b22222;">from yakor_spb@emacs.conference.jabber.ru</span>
(semantic-load-enable-excessive-code-helpers)

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Code Folding ; http://alexott-ru.blogspot.com/2009/01/blog-post.html</span>
(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my-semantic-hook</span> ()
  (semantic-tag-folding-mode 1))
(add-hook 'semantic-init-hooks 'my-semantic-hook)
</pre>
</div>

<p>
Теперь можно получить настоящее удовольствие при программировании!
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Emacs Code Browser</h2>
<div class="outline-text-2" id="text-3">
<p>
Добавляем в CEDET EmacsCodeBrowser, который превращает emacs в
многоязыковую IDE.
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Инсталляция</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Берем снапшот из &lt;a href="<a href="http://ecb.sourceforge.net/cvs_snapshots/ecb.tar.gz">http://ecb.sourceforge.net/cvs_snapshots/ecb.tar.gz</a>"&gt;официального
репозитория&lt;/a&gt; и распаковываем в &lt;code&gt;~/.emacs.d/ecb&lt;/code&gt;
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">Конфигурирование</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Добавляем в конфиграционный файл Емакса следующие строчки:
</p>

<div class="org-src-container">

<pre class="src src-sh">;; Load ECB
(add-to-list <span style="color: #8b2252;">'load-path "~/.emacs.d/ecb")</span>
<span style="color: #8b2252;">(require '</span>ecb-autoloads)
(global-set-key (kbd <span style="color: #8b2252;">"C-x p"</span>) <span style="color: #8b2252;">'ecb-activate)</span>
<span style="color: #8b2252;">(global-set-key (kbd "C-x j") '</span>ecb-deactivate)
(global-set-key (kbd <span style="color: #8b2252;">"C-x ,"</span>) <span style="color: #8b2252;">'ecb-toggle-ecb-windows)</span>
<span style="color: #8b2252;">(global-set-key (kbd "\e\eg") '</span>goto-line)
(global-set-key [?\M-g] <span style="color: #8b2252;">'goto-line)</span>
<span style="color: #8b2252;">(define-key global-map (kbd "C-&lt;tab&gt;") '</span>workspace-controller)
(setq ecb-tip-of-the-day nil)
(setq ecb-prescan-directories-for-emptyness nil)
</pre>
</div>

<p>
После этого перезапускаем Емакс и даем команду &lt;code&gt;M-x ecb-byte-compile&lt;/code&gt;,
которая ускорит загрузку нашей среды программирования.
</p>

<p>
Теперь, чтобы запустить ECB можно нажать &lt;code&gt;C-x p&lt;/code&gt; А чтобы скрыть &lt;code&gt;C-x&lt;/code&gt; ,
Ну а если вы хотите вообще выключить ECB - &lt;code&gt;C-x j&lt;/code&gt; При желании вы можете настроить свои
комбинации клавиш.
</p>

<p>
Продуктивной работы!
</p>
</div>
</div>
</div>
