org/doc/emacs-set.org
* Color-theme


Время раскрасить наш emacs! Берем архив с темами и плагином (файл
color-theme.el.gz) тут: http://download.gna.org/color-theme/

Потом распаковываем в папку <code>~/.emacs.d/</ode>

В файл ~~/.emacs.d/init.el~ добавляем следующий код:

#+BEGIN_SRC lisp
  (add-to-list 'load-path "~/.emacs.d/") ; добавляем путь к файлам расширений
  ;; http://habrahabr.ru/blogs/emacs/25854/
  ;; http://download.gna.org/color-theme/
  (require 'color-theme) ; подгружаем "модуль раскраски"
  (color-theme-robin-hood) ; выбрать конкретную схему
#+END_SRC

Последнюю строчку можно заменить на любую из тем, которая вам
понравится, их там очень много. Чтобы просмотреть некоторые из них
выполните M-x color-theme-[TAB] и автодополнение вам поможет!

Здесь нужны некоторые пояснения. В емаксе есть переменная ~load-path~,
которая хранит список путей, где будут искаться расширения, при
попытке их загрузить с помощью (require 'расширение) когда вы
вызываете add-to-list вы добавляете к этому списку свой путь. После
этого require найдет нужно расширение в файле "расширение.el" и
выполнит его так же, как если бы оно было включено в
init.el. Соответственно все определенные в этом расширении функции
станут доступны.

Кстати, вы всегда можете посмотрель любую переменную, выполнив C-h v

* Комментирование и поиск

Перед тем, как добавить следующее расширение улучшим наш Emacs еще
двумя маленькими функциями. Первая из них позволяет удобно работать с
комменариями - нужно просто нажать C-\ а вторая помогает искать
текст. Испробуйте эти небольшие расширения самостоятельно (код лучше
вставить до блока EXTENSIONS

#+BEGIN_SRC lisp
;; Comment function
(defun comment-or-uncomment-this (&optional lines)
  (interactive "P")
  (if mark-active
      (if (< (mark) (point))
          (comment-or-uncomment-region (mark) (point))
          (comment-or-uncomment-region (point) (mark)))
      (comment-or-uncomment-region
       (line-beginning-position)
       (line-end-position lines))))

(global-set-key (kbd "C-;") 'comment-or-uncomment-this)


;; Поиск от kostafey C-f|C-r C-v
(global-unset-key "\C-f")
(global-set-key "\C-f" 'isearch-forward)
(global-set-key "\C-r" 'isearch-backward)
(add-hook 'isearch-mode-hook
		  '(lambda ()
			 (define-key isearch-mode-map "\C-f"
			   'isearch-repeat-forward)
			 (define-key isearch-mode-map "\C-r"
			   'isearch-repeat-backward)
			 (define-key isearch-mode-map "\C-v"
			   'isearch-yank-kill)))
#+END_SRC

* Cua-mode

Когда вы запускаете Емакс вы видите перед собой окно текущего рабочего
буфера, которое занимает почти весь экран и так называемый
"минибуфер", в котором можно вводить разнообразные команды. Они
разделены строкой состояния, в которой показана информация о текущих
режимах работы Емакс.

Чтобы выйти в минибуфер и попробовать набрать так команду shell
нажмите M-x shell. По историческим причинам М - значит Alt, то есть вы
должны удерживая Alt нажать "x" и курсор переместиться в минибуффер,
где вы сможете набрать shell и завершить набор нажатием Enter. После
этого в рабочем буфере появится shell

Сейчас мы приступим к конфигурированию Емакса из самого
Емакса. Используя shell создайте каталог "~/.emacs.d" а в нем файл
"init.el" - это основной конфигурационный файл Емакса по умолчанию:

#+BEGIN_SRC sh
  mkdir .e.d
  cd e.d
  touch init.el
#+END_SRC

Теперь время открыть этот файл в Емаксе. Наберите C-x C-f и введите
путь к файлу. Автодополнение работает при нажатии клавиши TAB

Начнем конфигурировать Емакс. Первое, что имеет смысл сделать
человеку, привыкшему к стандартным комбинациям клавиш для копипастинга
- это настроить их. Запишем в наш init.el следующее:

#+BEGIN_SRC sh
;; Установка режима CUA поддержка Ctr-c,v,x,d как в windows
;; CUA mode: C-x, C-c, C-v for copying, pasting, C-z for undo
(cua-mode t)
(transient-mark-mode 1) ;; No region when it is not highlighted
(setq cua-keep-region-after-copy t) ;; Standard Windows behaviour
;; Настройка поведения редактора "как в Windows"
;; настройка клавиатуры как в Windows
;; Delete (and its variants) delete forward instead of backward.
;; C-Backspace kills backward a word (as C-Delete normally would).
;; M-Backspace does undo.
;; Home and End move to beginning and end of line
;; C-Home and C-End move to beginning and end of buffer.
;; C-Escape does list-buffers."
(pc-bindings-mode)
;; Настройка выделения "как в Windows"
(pc-selection-mode)
(delete-selection-mode nil)

;; Makes clipboard work
(setq x-select-enable-clipboard t)
(setq interprogram-paste-function 'x-cut-buffer-or-selection-value)
(setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING))
#+END_SRC


Родные комбинации Емакса ничуть не менее удобны, и постепенно вы
откажетесь от cua-mode, но на первых порах проще работать так. Теперь
после перезагрузки Емакса видновая копипаста будет работать. Впрочем,
даже перезагрузка не требуется - поставьте курсор в конце каждой
строки и нажмите C-x C-e и изменения будут применены сразу же!

Для тех же, кто готов вместе со мной идти до конца - расскажу о родной
копипасте Емакса:

| Копировать                                 | M-w     |
| Вырезать                                   | C-w     |
| Вставить                                   | C-y     |
| Удалить от позиции курсора до конца строки | C-k     |
| Отменить последнее действие (Undo)         | C-_     |
| Установить снять выделение                 | C-Space |
* Emacs-Jabber

Емакс - это не только редактор. Сейчас мы добавим к нему jabber -
систему мгновенных сообщений, которую все прогрессивное человечество
использует вместо попсовых мессенджеров

