www/doc/emacs-set.html

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Color-theme</h2>
<div class="outline-text-2" id="text-4">
<p>
Время раскрасить наш emacs! Берем архив с темами и плагином (файл
color-theme.el.gz) тут: <a href="http://download.gna.org/color-theme/">http://download.gna.org/color-theme/</a>
</p>

<p>
Потом распаковываем в папку &lt;code&gt;~/.emacs.d/&lt;/ode&gt;
</p>

<p>
В файл <code>~/.emacs.d/init.el</code> добавляем следующий код:
</p>

<div class="org-src-container">

<pre class="src src-lisp">(add-to-list 'load-path <span style="color: #8b2252;">"~/.emacs.d/"</span>) <span style="color: #b22222;">; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084; &#1087;&#1091;&#1090;&#1100; &#1082; &#1092;&#1072;&#1081;&#1083;&#1072;&#1084; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1081;</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">http://habrahabr.ru/blogs/emacs/25854/</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">http://download.gna.org/color-theme/</span>
(<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">color-theme</span>) <span style="color: #b22222;">; &#1087;&#1086;&#1076;&#1075;&#1088;&#1091;&#1078;&#1072;&#1077;&#1084; "&#1084;&#1086;&#1076;&#1091;&#1083;&#1100; &#1088;&#1072;&#1089;&#1082;&#1088;&#1072;&#1089;&#1082;&#1080;"</span>
(color-theme-robin-hood) <span style="color: #b22222;">; &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1091;&#1102; &#1089;&#1093;&#1077;&#1084;&#1091;</span>
</pre>
</div>

<p>
Последнюю строчку можно заменить на любую из тем, которая вам
понравится, их там очень много. Чтобы просмотреть некоторые из них
выполните M-x color-theme-[TAB] и автодополнение вам поможет!
</p>

<p>
Здесь нужны некоторые пояснения. В емаксе есть переменная <code>load-path</code>,
которая хранит список путей, где будут искаться расширения, при
попытке их загрузить с помощью (require 'расширение) когда вы
вызываете add-to-list вы добавляете к этому списку свой путь. После
этого require найдет нужно расширение в файле "расширение.el" и
выполнит его так же, как если бы оно было включено в
init.el. Соответственно все определенные в этом расширении функции
станут доступны.
</p>

<p>
Кстати, вы всегда можете посмотрель любую переменную, выполнив C-h v
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Комментирование и поиск</h2>
<div class="outline-text-2" id="text-5">
<p>
Перед тем, как добавить следующее расширение улучшим наш Emacs еще
двумя маленькими функциями. Первая из них позволяет удобно работать с
комменариями - нужно просто нажать C-\ а вторая помогает искать
текст. Испробуйте эти небольшие расширения самостоятельно (код лучше
вставить до блока EXTENSIONS
</p>

<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">Comment function</span>
(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">comment-or-uncomment-this</span> (<span style="color: #228b22;">&amp;optional</span> lines)
  (interactive <span style="color: #8b2252;">"P"</span>)
  (<span style="color: #a020f0;">if</span> mark-active
      (<span style="color: #a020f0;">if</span> (&lt; (mark) (point))
          (comment-or-uncomment-region (mark) (point))
          (comment-or-uncomment-region (point) (mark)))
      (comment-or-uncomment-region
       (line-beginning-position)
       (line-end-position lines))))

(global-set-key (kbd <span style="color: #8b2252;">"C-;"</span>) 'comment-or-uncomment-this)


<span style="color: #b22222;">;; </span><span style="color: #b22222;">&#1055;&#1086;&#1080;&#1089;&#1082; &#1086;&#1090; kostafey C-f|C-r C-v</span>
(global-unset-key <span style="color: #8b2252;">"\C-f"</span>)
(global-set-key <span style="color: #8b2252;">"\C-f"</span> 'isearch-forward)
(global-set-key <span style="color: #8b2252;">"\C-r"</span> 'isearch-backward)
(add-hook 'isearch-mode-hook
          '(<span style="color: #a020f0;">lambda</span> ()
             (<span style="color: #a020f0;">define-key</span> isearch-mode-map <span style="color: #8b2252;">"\C-f"</span>
               'isearch-repeat-forward)
             (<span style="color: #a020f0;">define-key</span> isearch-mode-map <span style="color: #8b2252;">"\C-r"</span>
               'isearch-repeat-backward)
             (<span style="color: #a020f0;">define-key</span> isearch-mode-map <span style="color: #8b2252;">"\C-v"</span>
               'isearch-yank-kill)))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Cua-mode</h2>
<div class="outline-text-2" id="text-6">
<p>
Когда вы запускаете Емакс вы видите перед собой окно текущего рабочего
буфера, которое занимает почти весь экран и так называемый
"минибуфер", в котором можно вводить разнообразные команды. Они
разделены строкой состояния, в которой показана информация о текущих
режимах работы Емакс.
</p>

<p>
Чтобы выйти в минибуфер и попробовать набрать так команду shell
нажмите M-x shell. По историческим причинам М - значит Alt, то есть вы
должны удерживая Alt нажать "x" и курсор переместиться в минибуффер,
где вы сможете набрать shell и завершить набор нажатием Enter. После
этого в рабочем буфере появится shell
</p>

<p>
Сейчас мы приступим к конфигурированию Емакса из самого
Емакса. Используя shell создайте каталог "~/.emacs.d" а в нем файл
"init.el" - это основной конфигурационный файл Емакса по умолчанию:
</p>

<div class="org-src-container">

<pre class="src src-sh">mkdir .e.d
<span style="color: #483d8b;">cd</span> e.d
touch init.el
</pre>
</div>

<p>
Теперь время открыть этот файл в Емаксе. Наберите C-x C-f и введите
путь к файлу. Автодополнение работает при нажатии клавиши TAB
</p>

<p>
Начнем конфигурировать Емакс. Первое, что имеет смысл сделать
человеку, привыкшему к стандартным комбинациям клавиш для копипастинга
</p>
<ul class="org-ul">
<li>это настроить их. Запишем в наш init.el следующее:
</li>
</ul>

<div class="org-src-container">

<pre class="src src-sh">;; &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; CUA &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1072; Ctr-c,v,x,d &#1082;&#1072;&#1082; &#1074; windows
;; CUA mode: C-x, C-c, C-v for copying, pasting, C-z for undo
(cua-mode t)
(transient-mark-mode 1) ;; No region when it is not highlighted
(setq cua-keep-region-after-copy t) ;; Standard Windows behaviour
;; &#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072; &#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;&#1072; <span style="color: #8b2252;">"&#1082;&#1072;&#1082; &#1074; Windows"</span>
;; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1099; &#1082;&#1072;&#1082; &#1074; Windows
;; Delete (and its variants) delete forward instead of backward.
;; C-Backspace kills backward a word (as C-Delete normally would)<span style="color: #483d8b;">.</span>
;; M-Backspace does undo.
;; Home and End move to beginning and end of line
;; C-Home and C-End move to beginning and end of buffer.
;; C-Escape does list-buffers.<span style="color: #8b2252;">"</span>
<span style="color: #8b2252;">(pc-bindings-mode)</span>
<span style="color: #8b2252;">;; &#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; "</span>&#1082;&#1072;&#1082; &#1074; Windows<span style="color: #8b2252;">"</span>
<span style="color: #8b2252;">(pc-selection-mode)</span>
<span style="color: #8b2252;">(delete-selection-mode nil)</span>

<span style="color: #8b2252;">;; Makes clipboard work</span>
<span style="color: #8b2252;">(setq x-select-enable-clipboard t)</span>
<span style="color: #8b2252;">(setq interprogram-paste-function 'x-cut-buffer-or-selection-value)</span>
<span style="color: #8b2252;">(setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING))</span>
</pre>
</div>


<p>
Родные комбинации Емакса ничуть не менее удобны, и постепенно вы
откажетесь от cua-mode, но на первых порах проще работать так. Теперь
после перезагрузки Емакса видновая копипаста будет работать. Впрочем,
даже перезагрузка не требуется - поставьте курсор в конце каждой
строки и нажмите C-x C-e и изменения будут применены сразу же!
</p>

<p>
Для тех же, кто готов вместе со мной идти до конца - расскажу о родной
копипасте Емакса:
</p>

<table>


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="left">Копировать</td>
<td class="left">M-w</td>
</tr>

<tr>
<td class="left">Вырезать</td>
<td class="left">C-w</td>
</tr>

<tr>
<td class="left">Вставить</td>
<td class="left">C-y</td>
</tr>

<tr>
<td class="left">Удалить от позиции курсора до конца строки</td>
<td class="left">C-k</td>
</tr>

<tr>
<td class="left">Отменить последнее действие (Undo)</td>
<td class="left">C-_</td>
</tr>

<tr>
<td class="left">Установить снять выделение</td>
<td class="left">C-Space</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Emacs-Jabber</h2>
<div class="outline-text-2" id="text-7">
<p>
Емакс - это не только редактор. Сейчас мы добавим к нему jabber -
систему мгновенных сообщений, которую все прогрессивное человечество
использует вместо попсовых мессенджеров
</p>
</div>
