org/doc/emacs-set.org
** Инсталляция

Самый простой способ установить jabber - из репозиториев:

#+BEGIN_SRC sh
  sudo apt-get install emacs-jabber
#+END_SRC

Но я решил взять более свежий пакет из официального git`a и следовать
приведенным в файле README инструкциям

#+BEGIN_SRC sh
  git clone git://emacs-jabber.git.sourceforge.net/gitroot/emacs-jabber/emacs-jabber
  cd emacs-jabber
  autoreconf -a
  sudo apt-get install texinfo # если надо :)
  make
  sudo make install
#+END_SRC

** Настройка

В результате этих манипуляций у нас будет установленный свежий
emacs-jabber и нам останется только прописать в наш конфиг следующие
строки:

#+BEGIN_SRC lisp
  ;; JABBER
  (require 'jabber)
  (setq jabber-auto-reconnect t)
  (setq jabber-chat-buffer-format "*---%n-*")
  (setq jabber-groupchat-buffer-format "*===%n-*")
  (setq jabber-history-dir "~/.jabber-chatlogs")
  (setq jabber-history-enabled t)
  (setq jabber-history-muc-enabled t)
  (setq jabber-history-size-limit 1024000000)
  ;; M-x jabber-edit-bookmarks - для редактирвания закладок
#+END_SRC

Теперь после загрузки обновленного конфига достаточно нажать <code>C-x C-j
C-c</code> и ваш jabber внутри емакса будет запущен. В списке буферов
появится jabber-roster с понятной инструкцией по добавлению и удалению
контактов, а для чего-то более сложного всегда есть M-x jabber-[TAB]

Приятного общения! (мой jid - rigidus@jabber.ru)

* Wanderlust.

Теперь, когда у нас есть в Емаксе мессенджер, никто не мешает
подключить туда же и почту. Для Емакса написано несколько хороших
клиентов, но я пока попробовал только WanderLust. Он оказался очень
удобным и у меня пока нет желания переходить куда-то еще. Итак, начнем
с установки:

** Установка

#+BEGIN_SRC sh
 sudo apt-get install wl
#+END_SRC

У wanderlust-a неслабых размеров конфиг, причем начинать надо с
конфигурирования почтовых ящиков в специальном файле ~/.folder. Вот
его содержимое (имена ящиков я заменил, чтобы спаммеры не пронюхали :):

#+BEGIN_SRC lisp
rigidus@gmail.com {
	%inbox:rigidus@imap.gmail.com:993!         "inbox"
}
avenger@yandex.ru {
    %inbox:avenger@imap.yandex.ru:993!            "inbox"
    %alfa:avenger@imap.yandex.ru:993!             "alfa"
    %alfa-order:avenger@imap.yandex.ru:993!       "alfa-order"
    %ashmanov:avenger@imap.yandex.ru:993!         "ashmanov"
    %errors:avenger@imap.yandex.ru:993!           "errors"
    %job-list:avenger@imap.yandex.ru:993!         "job-list"
    %lj:avenger@imap.yandex.ru:993!               "lj"
    %self:avenger@imap.yandex.ru:993!             "self"
    %vkontakte:avenger@imap.yandex.ru:993!        "vkontakte"
    %work:avenger@imap.yandex.ru:993!             "work"
}
#+END_SRC

Как видите все imap папки указываются в специальном
формате. wanderlist так-же поддерживает и pop3, так что если у кого
есть конфиг - welcome в комментарии. А теперь посмотрим, как
конфигурируется все это добро в init.el

