www/doc/emacs-set.html

<div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1">Инсталляция</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Самый простой способ установить jabber - из репозиториев:
</p>

<div class="org-src-container">

<pre class="src src-sh">sudo apt-get install emacs-jabber
</pre>
</div>

<p>
Но я решил взять более свежий пакет из официального git`a и следовать
приведенным в файле README инструкциям
</p>

<div class="org-src-container">

<pre class="src src-sh">git clone git://emacs-jabber.git.sourceforge.net/gitroot/emacs-jabber/emacs-jabber
<span style="color: #483d8b;">cd</span> emacs-jabber
autoreconf -a
sudo apt-get install texinfo <span style="color: #b22222;"># </span><span style="color: #b22222;">&#1077;&#1089;&#1083;&#1080; &#1085;&#1072;&#1076;&#1086; :)</span>
make
sudo make install
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2">Настройка</h3>
<div class="outline-text-3" id="text-7-2">
<p>
В результате этих манипуляций у нас будет установленный свежий
emacs-jabber и нам останется только прописать в наш конфиг следующие
строки:
</p>

<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">JABBER</span>
(<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">jabber</span>)
(setq jabber-auto-reconnect t)
(setq jabber-chat-buffer-format <span style="color: #8b2252;">"*---%n-*"</span>)
(setq jabber-groupchat-buffer-format <span style="color: #8b2252;">"*===%n-*"</span>)
(setq jabber-history-dir <span style="color: #8b2252;">"~/.jabber-chatlogs"</span>)
(setq jabber-history-enabled t)
(setq jabber-history-muc-enabled t)
(setq jabber-history-size-limit 1024000000)
<span style="color: #b22222;">;; </span><span style="color: #b22222;">M-x jabber-edit-bookmarks - &#1076;&#1083;&#1103; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1074;&#1072;&#1085;&#1080;&#1103; &#1079;&#1072;&#1082;&#1083;&#1072;&#1076;&#1086;&#1082;</span>
</pre>
</div>

<p>
Теперь после загрузки обновленного конфига достаточно нажать &lt;code&gt;C-x C-j
C-c&lt;/code&gt; и ваш jabber внутри емакса будет запущен. В списке буферов
появится jabber-roster с понятной инструкцией по добавлению и удалению
контактов, а для чего-то более сложного всегда есть M-x jabber-[TAB]
</p>

<p>
Приятного общения! (мой jid - rigidus@jabber.ru)
</p>
</div>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">Wanderlust.</h2>
<div class="outline-text-2" id="text-8">
<p>
Теперь, когда у нас есть в Емаксе мессенджер, никто не мешает
подключить туда же и почту. Для Емакса написано несколько хороших
клиентов, но я пока попробовал только WanderLust. Он оказался очень
удобным и у меня пока нет желания переходить куда-то еще. Итак, начнем
с установки:
</p>
</div>

<div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1">Установка</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">

<pre class="src src-sh">sudo apt-get install wl
</pre>
</div>

<p>
У wanderlust-a неслабых размеров конфиг, причем начинать надо с
конфигурирования почтовых ящиков в специальном файле ~/.folder. Вот
его содержимое (имена ящиков я заменил, чтобы спаммеры не пронюхали :):
</p>

<div class="org-src-container">

<pre class="src src-lisp">rigidus@gmail.com {
    %inbox:rigidus@imap.gmail.com:993!         <span style="color: #8b2252;">"inbox"</span>
}
avenger@yandex.ru {
    %inbox:avenger@imap.yandex.ru:993!            <span style="color: #8b2252;">"inbox"</span>
    %alfa:avenger@imap.yandex.ru:993!             <span style="color: #8b2252;">"alfa"</span>
    %alfa-order:avenger@imap.yandex.ru:993!       <span style="color: #8b2252;">"alfa-order"</span>
    %ashmanov:avenger@imap.yandex.ru:993!         <span style="color: #8b2252;">"ashmanov"</span>
    %errors:avenger@imap.yandex.ru:993!           <span style="color: #8b2252;">"errors"</span>
    %job-list:avenger@imap.yandex.ru:993!         <span style="color: #8b2252;">"job-list"</span>
    %lj:avenger@imap.yandex.ru:993!               <span style="color: #8b2252;">"lj"</span>
    %self:avenger@imap.yandex.ru:993!             <span style="color: #8b2252;">"self"</span>
    %vkontakte:avenger@imap.yandex.ru:993!        <span style="color: #8b2252;">"vkontakte"</span>
    %work:avenger@imap.yandex.ru:993!             <span style="color: #8b2252;">"work"</span>
}
</pre>
</div>

<p>
Как видите все imap папки указываются в специальном
формате. wanderlist так-же поддерживает и pop3, так что если у кого
есть конфиг - welcome в комментарии. А теперь посмотрим, как
конфигурируется все это добро в init.el
</p>
</div>
</div>
