www/doc/emacs-set.html

<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2">Конфигурирование</h3>
<div class="outline-text-3" id="text-8-2">
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">http://www.gohome.org/wl/doc/wl_95.html#SEC95</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">http://box.matto.nl/emacsgmail.html</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">http://www.emacswiki.org/emacs/hgw-init-wl.el</span>
(autoload 'wl <span style="color: #8b2252;">"wl"</span> <span style="color: #8b2252;">"Wanderlust"</span> t)
(autoload 'wl-other-frame <span style="color: #8b2252;">"wl"</span> <span style="color: #8b2252;">"Wanderlust on new frame."</span> t)
(autoload 'wl-draft <span style="color: #8b2252;">"wl-draft"</span> <span style="color: #8b2252;">"Write draft with Wanderlust."</span> t)

(setq mime-edit-split-message nil)

(setq wl-from <span style="color: #8b2252;">"rigidus "</span>)
(setq elmo-imap4-default-user <span style="color: #8b2252;">"rigidus"</span>
      elmo-imap4-default-server <span style="color: #8b2252;">"imap.gmail.com"</span>
      elmo-imap4-default-port 993
      elmo-imap4-default-authenticate-type 'clear
      elmo-imap4-default-stream-type 'ssl
      elmo-imap4-use-modified-utf7 t

      wl-message-id-domain <span style="color: #8b2252;">"rigidus@gmail.com"</span>
      wl-from <span style="color: #8b2252;">"rigidus "</span>
      wl-smtp-posting-server <span style="color: #8b2252;">"smtp.gmail.com"</span>
      wl-smtp-connection-type 'starttls
      wl-smtp-posting-port 587
      wl-smtp-authenticate-type <span style="color: #8b2252;">"plain"</span>
      wl-smtp-posting-user <span style="color: #8b2252;">"rigidus"</span>
      wl-local-domain <span style="color: #8b2252;">"gmail.com"</span>

      elmo-pop3-debug t
      ssl-certificate-verification-policy 1
      wl-default-folder <span style="color: #8b2252;">"%inbox"</span>
      wl-default-spec <span style="color: #8b2252;">"%"</span>
      wl-folder-check-async t
      wl-thread-indent-level 4
      wl-thread-have-younger-brother-str <span style="color: #8b2252;">"+"</span>
      wl-thread-youngest-child-str       <span style="color: #8b2252;">"+"</span>
      wl-thread-vertical-str             <span style="color: #8b2252;">"|"</span>
      wl-thread-horizontal-str           <span style="color: #8b2252;">"-"</span>
      wl-thread-space-str                <span style="color: #8b2252;">" "</span>
      wl-summary-width  nil
      wl-summary-line-format <span style="color: #8b2252;">"%n%T%P %W %D-%M-%Y %h:%m %t%[%c %f% %] %s"</span>
      wl-message-buffer-prefetch-folder-type-list nil
      mime-transfer-level 8
      mime-edit-split-message nil
      mime-edit-message-max-length 32768
      mime-header-accept-quoted-encoded-words t
      mime-browse-url-function 'browse-url-conkeror
      pgg-passphrase-cache-expiry 300
      pgg-decrypt-automatically t
      wl-message-ignored-field-list '(<span style="color: #8b2252;">"^.*"</span>)
      wl-message-visible-field-list '(<span style="color: #8b2252;">"^From:"</span> <span style="color: #8b2252;">"^To:"</span> <span style="color: #8b2252;">"^Cc:"</span>
         <span style="color: #8b2252;">"^Date:"</span> <span style="color: #8b2252;">"^Subject:"</span> <span style="color: #8b2252;">"^User-Agent:"</span> <span style="color: #8b2252;">"^X-Mailer:"</span>)
      wl-message-sort-field-list    wl-message-visible-field-list
      wl-message-window-size '(1 . 3)
      wl-folder-window-width 40
      wl-draft-preview-attributes-buffer-lines 7
      wl-draft-config-alist
      '(
        ((string-match <span style="color: #8b2252;">"avenger"</span> wl-draft-parent-folder)
         (wl-message-id-domain . <span style="color: #8b2252;">"avenger@yandex.ru"</span>)
         (wl-from . <span style="color: #8b2252;">"rigidus "</span>)
         (<span style="color: #8b2252;">"From"</span> . <span style="color: #8b2252;">"avenger@yandex.ru"</span>)
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">("Fcc" . "%Sent:avenger@yandex.ru:993")</span>
         (wl-smtp-posting-server . <span style="color: #8b2252;">"smtp.yandex.ru"</span>)
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">(wl-smtp-connection-type . nil)</span>
         (wl-smtp-connection-type . 'starttls)
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">(wl-smtp-connection-type . 'ssl)</span>
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">(wl-smtp-posting-port . 25)</span>
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">(wl-smtp-posting-port . 465)</span>
         (wl-smtp-posting-port . 587)
         (wl-smtp-authenticate-type . <span style="color: #8b2252;">"plain"</span>)
         (wl-smtp-posting-user . <span style="color: #8b2252;">"avenger"</span>)
         (wl-local-domain . <span style="color: #8b2252;">"yandex.ru"</span>)
         )
        ((string-match <span style="color: #8b2252;">"rigidus"</span> wl-draft-parent-folder)
         (wl-message-id-domain . <span style="color: #8b2252;">"rigidus@gmail.com"</span>)
         (wl-from . <span style="color: #8b2252;">"rigidus "</span>)
         (<span style="color: #8b2252;">"From"</span> . <span style="color: #8b2252;">"rigidus@gmail.com"</span>)
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">("Fcc" . "%Sent:rigidus@imap.gmail.com:993")</span>
         (wl-smtp-posting-server . <span style="color: #8b2252;">"smtp.gmail.com"</span>)
         (wl-smtp-connection-type . 'starttls)
         (wl-smtp-posting-port . 587)
         (wl-smtp-authenticate-type . <span style="color: #8b2252;">"plain"</span>)
         (wl-smtp-posting-user . <span style="color: #8b2252;">"rigidus"</span>)
         (wl-local-domain . <span style="color: #8b2252;">"gmail.com"</span>)
         )
        )
      )

(autoload 'wl-user-agent-compose <span style="color: #8b2252;">"wl-draft"</span> nil t)
(<span style="color: #a020f0;">if</span> (boundp 'mail-user-agent)
    (setq mail-user-agent 'wl-user-agent))
(<span style="color: #a020f0;">if</span> (fboundp 'define-mail-user-agent)
    (<span style="color: #a020f0;">define-mail-user-agent</span>
      'wl-user-agent
      'wl-user-agent-compose
      'wl-draft-send
      'wl-draft-kill
      'mail-send-hook))
</pre>
</div>

<p>
Как видите конфиг выглядит внушительно :) За рассшифровкой отдельных
полей обращайтесь к документации. Если же у кого-нибудь из читателей
есть конфиг подключения к какой-нибудь другой почте, кроме yandex-a и
gmail-ла - пожалуйста поделитесь настройками со мной!
</p>

<p>
После конфигурирования почтовый клиент можно запускать командой M-x wl
После того, как все пароли введены используйте команду
M-x elmo-passwd-alist-save чтобы сохранить их.
</p>

<p>
Основные клавиатурные комбинации можно узнать здесь: &lt;a
href="<a href="http://www.gohome.org/wl/doc/wl_82.html">http://www.gohome.org/wl/doc/wl_82.html</a>"&gt;<a href="http://www.gohome.org/wl/doc/wl_82.html">http://www.gohome.org/wl/doc/wl_82.html</a>&lt;/a&gt;
</p>
</div>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">MailCrypt</h2>
<div class="outline-text-2" id="text-9">
<p>
Почта, это конечно хорошо, но кто же в двадцать первом веке посылает
сообщения открытым текстом?! Поэтому поддержка шифрования в почте вещь
совершенно необходимая. Вот и wanderlust можно настроить для работы с
gnu-gpg. Базовыя статья по установке, на которую я опирался:
&lt;a href="<a href="http://box.matto.nl/wanderlustgpg.html">http://box.matto.nl/wanderlustgpg.html</a>"&gt;<a href="http://box.matto.nl/wanderlustgpg.html">http://box.matto.nl/wanderlustgpg.html</a>&lt;/a&gt;
</p>
</div>
