org/doc/emacs-set.org
** Инсталляция

 Первым делом скачиваем библиотеку mailcrypt c <a href="http://sourceforge.net/projects/mailcrypt/files/mailcrypt/3.5.8/mailcrypt-3.5.8.tar.gz/download">http://sourceforge.net/projects/mailcrypt/files/mailcrypt/3.5.8/mailcrypt-3.5.8.tar.gz/download</a>

 Распаковываем ее в рабочую директорию, делаем

#+BEGIN_SRC sh
  ./configure
  make
  sudo make install
#+END_SRC

 Прописываем в <code>~/.emacs.d/init.el</code>

#+BEGIN_SRC lisp
  ;; MAILCRYPT
  ;; Commands:
  ;;   M-x mc-encrypt.
  ;;   M-x mc-wl-decrypt-message
  ;; http://box.matto.nl/wanderlustgpg.html
  (load-library "mailcrypt") ; provides "mc-setversion"
  (mc-setversion "gpg")    ; for PGP 2.6 (default); also "5.0" and "gpg"

  (autoload 'mc-install-write-mode "mailcrypt" nil t)
  (autoload 'mc-install-read-mode "mailcrypt" nil t)
  (add-hook 'mail-mode-hook 'mc-install-write-mode)

  (require 'mailcrypt)
  (add-hook 'wl-summary-mode-hook 'mc-install-read-mode)
  (add-hook 'wl-mail-setup-hook 'mc-install-write-mode)

  (defun mc-wl-verify-signature ()
    (interactive)
    (save-window-excursion
      (wl-summary-jump-to-current-message)
      (mc-verify)))

  (defun mc-wl-decrypt-message ()
    (interactive)
    (save-window-excursion
      (wl-summary-jump-to-current-message)
      (let ((inhibit-read-only t))
        (mc-decrypt))))

  (eval-after-load "mailcrypt"
    '(setq mc-modes-alist
         (append
          (quote
           ((wl-draft-mode (encrypt . mc-encrypt-message)
              (sign . mc-sign-message))
            (wl-summary-mode (decrypt . mc-wl-decrypt-message)
              (verify . mc-wl-verify-signature))))
          mc-modes-alist)))
#+END_SRC

** Использование

Теперь можно использовать команды <code>M-x mc-encrypt</code> и
<code>M-x mc-wl-decrypt-message</code> внутри буфера сообщения, для
шифрования и расшифровывания сообщений.

И, на всякий пожарный, инструкция по использованию шифрования в gpg на
русском: https://nordrus.org/security/gnupg_manual_linux_w_sendkey.pdf

* lj-update

Как нам обновлять свой ЖЖ прямо из Емакса? Первое, что
нужно скачать - это последний снапшот LJ-UPDATE, который находится здесь:
http://edward.oconnor.cx/ljupdate/ljupdate.tar.gz.

Распакуйте его в папку ~/.emacs.d/ljupdate. Еще понадобится ряд файлов, о которых сказано в
README. Это файлы http-cookies.el, http-get.el и http-post.el, их последние версии нужно взять
из http://cvs.savannah.gnu.org/viewvc/http-emacs/http-emacs/ и положить в тот-же или любой
другой каталог, который входит в load-path. После этого в init.el можно прописать следующее:

#+BEGIN_SRC lisp
;; LJ-UPDATE
(add-to-list 'load-path "~/.emacs.d/ljupdate")
(require 'ljupdate)
#+END_SRC

Теперь, чтобы создавать посты в ЖЖ, используйте M-x lj-compose и M-x lj-compose-submit. Также
могут призодиться команды lj-login и lj-password. Чтобы посмотреть (а потом можно и
отредактировать) свои последние записи используйте M-x lj-browse-entries. Удобно!

* MetaJump

Довольно часто, редактируя тексты я переношу куски из одного файла в
другой, или даже делаю это внутри одного файла. И здесь мне всегда
пригождается возможность прыгать туда и обратно, которую я тоже подсмотрел
в <a href="http://kulchitsky.org/rus/linux/dotemacs.html#language">точках Емакс</a>.
Вот как это реализовано (Meta в данном случае можно понимать как ESC),
более подробно смотрите у автора.

#+BEGIN_SRC lisp
;; Итак, я предлагаю команду 'Meta-Meta-Shift-/' для того, чтобы запомнить текущую позицию
;; и команду 'Meta-Meta-/' для того, чтобы перейти
;; на запомненную позицию, прежде запомнив текущую.
;;Toggle between saved positions as in MIM editor
(defun save-point-and-switch ()
  "Save current point to register 0 and go
to the previously saved position"
 (interactive)
 (let (temp)
   (setq temp (point-marker))
   (when (not (equal (get-register 0) nil))
     (jump-to-register 0))
   (set-register 0 temp)))

;;Save current position to register 0
(defun save-point-only ()
 "Save current point to register 0"
 (interactive)
 (set-register 0 (point-marker)))

(global-set-key (kbd "\e\e/") 'save-point-and-switch)
(global-set-key (kbd "\e\e?") 'save-point-only)
#+END_SRC

* Мои мinor-режимы

Теперь мы поставим еще парочку расширений. Ставятся они тривиально, поэтому привожу только
код. highlight-parentheses раскрашивает скобки в разные цвета для удобного ориенитрования в
elist и lisp коде, а closure-template-html-mode - это специальный режим для редактирование
html-шаблонов. iswitchb дополняет ido-mode, о чем подробно можно прочесть в emacswiki (ссылка
приведена в комментариях)

