www/doc/emacs-set.html

<div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1">Инсталляция</h3>
<div class="outline-text-3" id="text-9-1">
<p>
Первым делом скачиваем библиотеку mailcrypt c &lt;a href="<a href="http://sourceforge.net/projects/mailcrypt/files/mailcrypt/3.5.8/mailcrypt-3.5.8.tar.gz/download">http://sourceforge.net/projects/mailcrypt/files/mailcrypt/3.5.8/mailcrypt-3.5.8.tar.gz/download</a>"&gt;<a href="http://sourceforge.net/projects/mailcrypt/files/mailcrypt/3.5.8/mailcrypt-3.5.8.tar.gz/download">http://sourceforge.net/projects/mailcrypt/files/mailcrypt/3.5.8/mailcrypt-3.5.8.tar.gz/download</a>&lt;/a&gt;
</p>

<p>
Распаковываем ее в рабочую директорию, делаем
</p>

<div class="org-src-container">

<pre class="src src-sh">./configure
make
sudo make install
</pre>
</div>

<p>
Прописываем в &lt;code&gt;~/.emacs.d/init.el&lt;/code&gt;
</p>

<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">MAILCRYPT</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Commands:</span>
<span style="color: #b22222;">;;   </span><span style="color: #b22222;">M-x mc-encrypt.</span>
<span style="color: #b22222;">;;   </span><span style="color: #b22222;">M-x mc-wl-decrypt-message</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">http://box.matto.nl/wanderlustgpg.html</span>
(load-library <span style="color: #8b2252;">"mailcrypt"</span>) <span style="color: #b22222;">; provides "mc-setversion"</span>
(mc-setversion <span style="color: #8b2252;">"gpg"</span>)    <span style="color: #b22222;">; for PGP 2.6 (default); also "5.0" and "gpg"</span>

(autoload 'mc-install-write-mode <span style="color: #8b2252;">"mailcrypt"</span> nil t)
(autoload 'mc-install-read-mode <span style="color: #8b2252;">"mailcrypt"</span> nil t)
(add-hook 'mail-mode-hook 'mc-install-write-mode)

(<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">mailcrypt</span>)
(add-hook 'wl-summary-mode-hook 'mc-install-read-mode)
(add-hook 'wl-mail-setup-hook 'mc-install-write-mode)

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">mc-wl-verify-signature</span> ()
  (interactive)
  (save-window-excursion
    (wl-summary-jump-to-current-message)
    (mc-verify)))

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">mc-wl-decrypt-message</span> ()
  (interactive)
  (save-window-excursion
    (wl-summary-jump-to-current-message)
    (<span style="color: #a020f0;">let</span> ((inhibit-read-only t))
      (mc-decrypt))))

(eval-after-load <span style="color: #8b2252;">"mailcrypt"</span>
  '(setq mc-modes-alist
       (append
        (quote
         ((wl-draft-mode (encrypt . mc-encrypt-message)
            (sign . mc-sign-message))
          (wl-summary-mode (decrypt . mc-wl-decrypt-message)
            (verify . mc-wl-verify-signature))))
        mc-modes-alist)))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-9-2" class="outline-3">
<h3 id="sec-9-2">Использование</h3>
<div class="outline-text-3" id="text-9-2">
<p>
Теперь можно использовать команды &lt;code&gt;M-x mc-encrypt&lt;/code&gt; и
&lt;code&gt;M-x mc-wl-decrypt-message&lt;/code&gt; внутри буфера сообщения, для
шифрования и расшифровывания сообщений.
</p>

<p>
И, на всякий пожарный, инструкция по использованию шифрования в gpg на
русском: <a href="https://nordrus.org/security/gnupg_manual_linux_w_sendkey.pdf">https://nordrus.org/security/gnupg_manual_linux_w_sendkey.pdf</a>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">lj-update</h2>
<div class="outline-text-2" id="text-10">
<p>
Как нам обновлять свой ЖЖ прямо из Емакса? Первое, что
нужно скачать - это последний снапшот LJ-UPDATE, который находится здесь:
<a href="http://edward.oconnor.cx/ljupdate/ljupdate.tar.gz">http://edward.oconnor.cx/ljupdate/ljupdate.tar.gz</a>.
</p>

<p>
Распакуйте его в папку ~/.emacs.d/ljupdate. Еще понадобится ряд файлов, о которых сказано в
README. Это файлы http-cookies.el, http-get.el и http-post.el, их последние версии нужно взять
из <a href="http://cvs.savannah.gnu.org/viewvc/http-emacs/http-emacs/">http://cvs.savannah.gnu.org/viewvc/http-emacs/http-emacs/</a> и положить в тот-же или любой
другой каталог, который входит в load-path. После этого в init.el можно прописать следующее:
</p>

<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">LJ-UPDATE</span>
(add-to-list 'load-path <span style="color: #8b2252;">"~/.emacs.d/ljupdate"</span>)
(<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">ljupdate</span>)
</pre>
</div>

<p>
Теперь, чтобы создавать посты в ЖЖ, используйте M-x lj-compose и M-x lj-compose-submit. Также
могут призодиться команды lj-login и lj-password. Чтобы посмотреть (а потом можно и
отредактировать) свои последние записи используйте M-x lj-browse-entries. Удобно!
</p>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">MetaJump</h2>
<div class="outline-text-2" id="text-11">
<p>
Довольно часто, редактируя тексты я переношу куски из одного файла в
другой, или даже делаю это внутри одного файла. И здесь мне всегда
пригождается возможность прыгать туда и обратно, которую я тоже подсмотрел
в &lt;a href="<a href="http://kulchitsky.org/rus/linux/dotemacs.html#language">http://kulchitsky.org/rus/linux/dotemacs.html#language</a>"&gt;точках Емакс&lt;/a&gt;.
Вот как это реализовано (Meta в данном случае можно понимать как ESC),
более подробно смотрите у автора.
</p>

<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">&#1048;&#1090;&#1072;&#1082;, &#1103; &#1087;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1102; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1091; 'Meta-Meta-Shift-/' &#1076;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1079;&#1072;&#1087;&#1086;&#1084;&#1085;&#1080;&#1090;&#1100; &#1090;&#1077;&#1082;&#1091;&#1097;&#1091;&#1102; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1102;</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">&#1080; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1091; 'Meta-Meta-/' &#1076;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1077;&#1088;&#1077;&#1081;&#1090;&#1080;</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">&#1085;&#1072; &#1079;&#1072;&#1087;&#1086;&#1084;&#1085;&#1077;&#1085;&#1085;&#1091;&#1102; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1102;, &#1087;&#1088;&#1077;&#1078;&#1076;&#1077; &#1079;&#1072;&#1087;&#1086;&#1084;&#1085;&#1080;&#1074; &#1090;&#1077;&#1082;&#1091;&#1097;&#1091;&#1102;.</span>
<span style="color: #b22222;">;;</span><span style="color: #b22222;">Toggle between saved positions as in MIM editor</span>
(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">save-point-and-switch</span> ()
  <span style="color: #8b2252;">"Save current point to register 0 and go</span>
<span style="color: #8b2252;">to the previously saved position"</span>
 (interactive)
 (<span style="color: #a020f0;">let</span> (temp)
   (setq temp (point-marker))
   (<span style="color: #a020f0;">when</span> (not (equal (get-register 0) nil))
     (jump-to-register 0))
   (set-register 0 temp)))

<span style="color: #b22222;">;;</span><span style="color: #b22222;">Save current position to register 0</span>
(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">save-point-only</span> ()
 <span style="color: #8b2252;">"Save current point to register 0"</span>
 (interactive)
 (set-register 0 (point-marker)))

(global-set-key (kbd <span style="color: #8b2252;">"\e\e/"</span>) 'save-point-and-switch)
(global-set-key (kbd <span style="color: #8b2252;">"\e\e?"</span>) 'save-point-only)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12">Мои мinor-режимы</h2>
<div class="outline-text-2" id="text-12">
<p>
Теперь мы поставим еще парочку расширений. Ставятся они тривиально, поэтому привожу только
код. highlight-parentheses раскрашивает скобки в разные цвета для удобного ориенитрования в
elist и lisp коде, а closure-template-html-mode - это специальный режим для редактирование
html-шаблонов. iswitchb дополняет ido-mode, о чем подробно можно прочесть в emacswiki (ссылка
приведена в комментариях)
</p>
</div>
