www/doc/emacs-set.html

<div id="outline-container-sec-12-1" class="outline-3">
<h3 id="sec-12-1">Настройка</h3>
<div class="outline-text-3" id="text-12-1">
<div class="org-src-container">

<pre class="src src-lisp">HIGHLIHT-PARENTHESES
<span style="color: #b22222;">;; </span><span style="color: #b22222;">http://nschum.de/src/emacs/highlight-parentheses/highlight-parentheses.el</span>
(<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">highlight-parentheses</span>)
<span style="color: #b22222;">;; </span><span style="color: #b22222;">(add-hook 'lisp-mode-hook (highlight-parentheses-mode))</span>
(<span style="color: #a020f0;">define-globalized-minor-mode</span> global-highlight-parentheses-mode
    highlight-parentheses-mode highlight-parentheses-mode)
(setq hl-paren-colors
'(<span style="color: #8b2252;">"#FF0000"</span> <span style="color: #8b2252;">"#FFBF00"</span> <span style="color: #8b2252;">"#1FFF00"</span> <span style="color: #8b2252;">"#009EFF"</span> <span style="color: #8b2252;">"#2100FF"</span> <span style="color: #8b2252;">"gray10"</span> <span style="color: #8b2252;">"gray70"</span> <span style="color: #8b2252;">"gray90"</span>))
(global-highlight-parentheses-mode)


<span style="color: #b22222;">;; </span><span style="color: #b22222;">CLOSURE-TEMPLATE-HTML-MODE</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">http://github.com/archimag/cl-closure-template/raw/master/closure-template-html-mode.el</span>
(<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">closure-template-html-mode</span>)


<span style="color: #b22222;">;; </span><span style="color: #b22222;">ISWITCHB http://www.emacswiki.org/emacs/IswitchBuffers</span>
(<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">iswitchb</span>)
(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">iswitchb-local-keys</span> ()
  (mapc (<span style="color: #a020f0;">lambda</span> (K)
          (<span style="color: #a020f0;">let*</span> ((key (car K)) (fun (cdr K)))
            (<span style="color: #a020f0;">define-key</span> iswitchb-mode-map (edmacro-parse-keys key) fun)))
        '((<span style="color: #8b2252;">"&lt;right&gt;"</span> . iswitchb-next-match)
          (<span style="color: #8b2252;">"&lt;left&gt;"</span>  . iswitchb-prev-match)
          (<span style="color: #8b2252;">"&lt;up&gt;"</span>    . ignore             )
          (<span style="color: #8b2252;">"&lt;down&gt;"</span>  . ignore             ))))
(add-hook 'iswitchb-define-mode-map-hook 'iswitchb-local-keys)
<span style="color: #b22222;">;; </span><span style="color: #b22222;">http://www.emacswiki.org/emacs/IswitchBuffers</span>
(defadvice iswitchb-kill-buffer (after rescan-after-kill activate)
  <span style="color: #8b2252;">"*Regenerate the list of matching buffer names after a kill.</span>
<span style="color: #8b2252;">    Necessary if using `</span><span style="color: #008b8b;">uniquify</span><span style="color: #8b2252;">' with `</span><span style="color: #008b8b;">uniquify-after-kill-buffer-p</span><span style="color: #8b2252;">'</span>
<span style="color: #8b2252;">    set to non-nil."</span>
  (setq iswitchb-buflist iswitchb-matches)
  (iswitchb-rescan))
<span style="color: #b22222;">;; </span><span style="color: #b22222;">http://www.emacswiki.org/emacs/IswitchBuffers</span>
(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">iswitchb-rescan</span> ()
  <span style="color: #8b2252;">"*Regenerate the list of matching buffer names."</span>
  (interactive)
  (iswitchb-make-buflist iswitchb-default)
  (setq iswitchb-rescan t))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13">Русификация Емакса</h2>
<div class="outline-text-2" id="text-13">
<p>
Емакс имеет встроенную и независящую от операционной системы
переключалку режимов ввода, и если ее правильно сконфигурировать - вы,
с вашим Емаксом, принесенным на флешке, сможете работать даже там, где
отсутствует поддержка национальных алфавитов.
</p>

<p>
Раскладку клавиатуры мы будем переключать по нажатию C-\, что
используется и по умолчанию и очень удобно на ноутбучных клавиатурах
hp, ну а если вам это не нравится - просто поменяйте клавишу на
удобную для вас. Привожу кусок конфига:
</p>

<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">http://kulchitsky.org/rus/linux/dotemacs.html</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1088;&#1072;&#1089;&#1082;&#1083;&#1072;&#1076;&#1082;&#1080; &#1082;&#1072;&#1082; &#1074; &#1074;&#1080;&#1085;&#1076;&#1086;&#1074;&#1089; &#1087;&#1088;&#1080; &#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1080; &#1087;&#1086; &#1057;-\</span>
(global-set-key (kbd <span style="color: #8b2252;">"\C-\\"</span>) 'user-toggle-input-method)
<span style="color: #b22222;">;</span><span style="color: #b22222;">(global-set-key (kbd "\e(") 'user-to-cyr) ; Alt+Shift+9</span>
<span style="color: #b22222;">;</span><span style="color: #b22222;">(global-set-key (kbd "\e)") 'user-to-nil) ; Alt+Shift+0</span>

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">user-cyrillic-redefinitions</span> ()
  <span style="color: #8b2252;">"Set of global keys binding for cyrillic.</span>
<span style="color: #8b2252;">   This function is to be called from user-toggle-input-method"</span>
  (global-set-key (kbd <span style="color: #8b2252;">"?"</span>) (<span style="color: #a020f0;">lambda</span>()(interactive)(insert <span style="color: #8b2252;">","</span>)))
  (global-set-key (kbd <span style="color: #8b2252;">"/"</span>) (<span style="color: #a020f0;">lambda</span>()(interactive)(insert <span style="color: #8b2252;">"."</span>)))
  (global-set-key (kbd <span style="color: #8b2252;">","</span>) (<span style="color: #a020f0;">lambda</span>()(interactive)(insert <span style="color: #8b2252;">":"</span>)))
  (global-set-key (kbd <span style="color: #8b2252;">":"</span>) (<span style="color: #a020f0;">lambda</span>()(interactive)(insert <span style="color: #8b2252;">"%"</span>)))
  (global-set-key (kbd <span style="color: #8b2252;">"*"</span>) (<span style="color: #a020f0;">lambda</span>()(interactive)(insert <span style="color: #8b2252;">";"</span>)))
  (global-set-key (kbd <span style="color: #8b2252;">";"</span>) (<span style="color: #a020f0;">lambda</span>()(interactive)(insert <span style="color: #8b2252;">"*"</span>)))
  (global-set-key (kbd <span style="color: #8b2252;">"."</span>) (<span style="color: #a020f0;">lambda</span>()(interactive)(insert <span style="color: #8b2252;">"?"</span>))))

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">user-nil-redefinitions</span> ()
 <span style="color: #8b2252;">"Restoring global keys binding after user-cyrillic-redefinitions.</span>
<span style="color: #8b2252;">  This function is to be called from user-toggle-input-method"</span>
  (global-set-key (kbd <span style="color: #8b2252;">"?"</span>) (<span style="color: #a020f0;">lambda</span>()(interactive)(self-insert-command 1)))
  (global-set-key (kbd <span style="color: #8b2252;">"/"</span>) (<span style="color: #a020f0;">lambda</span>()(interactive)(self-insert-command 1)))
  (global-set-key (kbd <span style="color: #8b2252;">"$"</span>) (<span style="color: #a020f0;">lambda</span>()(interactive)(self-insert-command 1)))
  (global-set-key (kbd <span style="color: #8b2252;">","</span>) (<span style="color: #a020f0;">lambda</span>()(interactive)(self-insert-command 1)))
  (global-set-key (kbd <span style="color: #8b2252;">":"</span>) (<span style="color: #a020f0;">lambda</span>()(interactive)(self-insert-command 1)))
  (global-set-key (kbd <span style="color: #8b2252;">"*"</span>) (<span style="color: #a020f0;">lambda</span>()(interactive)(self-insert-command 1)))
  (global-set-key (kbd <span style="color: #8b2252;">";"</span>) (<span style="color: #a020f0;">lambda</span>()(interactive)(self-insert-command 1)))
  (global-set-key (kbd <span style="color: #8b2252;">"."</span>) (<span style="color: #a020f0;">lambda</span>()(interactive)(self-insert-command 1))))

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">user-toggle-input-method</span> ()
  <span style="color: #8b2252;">"Change the stadart function tuggle-input-method</span>
<span style="color: #8b2252;">   to redefine keys for cyrillic input from UNIX type to win type"</span>
  (interactive)
  (toggle-input-method)
  (<span style="color: #a020f0;">if</span> (string= current-input-method <span style="color: #8b2252;">"cyrillic-jcuken"</span>)
      (user-cyrillic-redefinitions)
    (user-nil-redefinitions))
  (message <span style="color: #8b2252;">"keybord changed to %s"</span> current-input-method))

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">user-to-cyr</span> ()
  <span style="color: #8b2252;">"Change input method to Cyrillic,</span>
<span style="color: #8b2252;">   I bound this function with Alt-Shift-9, that is M-("</span>
  (interactive)
  (<span style="color: #a020f0;">when</span> (string= current-input-method nil)
      (user-toggle-input-method)))

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">user-to-nil</span> ()
  <span style="color: #8b2252;">"Change input method to nil (generally to English),</span>
<span style="color: #8b2252;">   I bound this function with Alt-Sfift-0 that is M-)"</span>
  (interactive)
  (<span style="color: #a020f0;">when</span> (string= current-input-method <span style="color: #8b2252;">"cyrillic-jcuken"</span>)
      (user-toggle-input-method)))
</pre>
</div>
</div>
</div>
