www/doc/emacs-set.html

<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14">Полезные мелочи</h2>
<div class="outline-text-2" id="text-14">
<p>
Сейчас мы продолжим конфигурирование нашего Емакса, чтобы сделать его
максимально удобным для жизни. Так например, при выполнении команды
ls в shell Емакс не преобразовывает escape-последовательности в
правильные цвета, на что жалуются новички. Не проблема - сейчас мы это
поправим! Добавляем в наш ~/.emacs.d/init.el :
</p>

<p>
;; для корректного выведения escape-последовательностей shell`a
</p>

<div class="org-src-container">

<pre class="src src-lisp">(add-hook 'shell-mode-hook 'ansi-color-for-comint-mode-on)
</pre>
</div>

<p>
Еще одна головная боль - автоопределение кодировок. Иногда не
срабатывает на коротких текстах :) Поэтому важно расставить
приоритеты:
</p>

<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1072;&#1074;&#1090;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1086;&#1082;. &#1055;&#1077;&#1088;&#1074;&#1086;&#1081; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1090;&#1100;&#1089;&#1103; utf-8-unix</span>
(prefer-coding-system 'cp866)
(prefer-coding-system 'koi8-r-unix)
(prefer-coding-system 'windows-1251-dos)
(prefer-coding-system 'utf-8-unix)
</pre>
</div>

<p>
Теперь сделаем режим по умолчанию более удобным для использования. Я
хочу, чтобы в нем набираемая строка автоматически переносилась по
словам когда ее размер приближается к 80 символам:
</p>

<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">&#1056;&#1077;&#1078;&#1080;&#1084; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; c &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1086;&#1084; &#1089;&#1090;&#1088;&#1086;&#1082; &#1087;&#1086; &#1096;&#1080;&#1088;&#1080;&#1085;&#1077; 80</span>
(setq default-major-mode 'text-mode)
(add-hook 'text-mode-hook 'turn-on-auto-fill)
(setq auto-fill-mode t)
(setq fill-column 80)
</pre>
</div>

<p>
Важная задача - сохранение файлов. По умолчанию все текстовые
редакторы стараются создавать бэкап-файлы в каталоге, где лежит
редактируемый файл и из-за этого бэкап-файлы часто попадают в
репозиторий, что само по себе неаккуратно. Настроим себе более умный
бэкап:
</p>

<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">&#1059;&#1076;&#1072;&#1083;&#1103;&#1077;&#1084; &#1086;&#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1073;&#1077;&#1083;&#1099; &#1087;&#1077;&#1088;&#1077;&#1076; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;</span>
(add-hook 'before-save-hook '(<span style="color: #a020f0;">lambda</span> ()
(delete-trailing-whitespace)))
<span style="color: #b22222;">;; </span><span style="color: #b22222;">&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1088;&#1077;&#1079;&#1077;&#1088;&#1074;&#1085;&#1099;&#1093; &#1082;&#1086;&#1087;&#1080;&#1081; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1091;&#1077;&#1084;&#1099;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; (Backup)</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">&#1085;&#1091;&#1084;&#1077;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1073;&#1101;&#1082;&#1072;&#1087; - 2 &#1087;&#1077;&#1088;&#1074;&#1099;&#1093; &#1080; 2 &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1093;</span>
(setq  backup-by-copying t      <span style="color: #b22222;">; don't clobber symlinks</span>
       backup-directory-alist  '((<span style="color: #8b2252;">"."</span> . <span style="color: #8b2252;">"~/backup"</span>))    <span style="color: #b22222;">; don't litter my fs tree</span>
       delete-old-versions t            <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1084;&#1077;&#1078;&#1091;&#1090;&#1086;&#1095;&#1085;&#1099;&#1093; &#1073;&#1101;&#1082;&#1072;&#1087;&#1086;&#1074;</span>
       kept-new-versions 6
       kept-old-versions 2
       version-control t)       <span style="color: #b22222;">; use versioned backups</span>
</pre>
</div>

<p>
И наконец, слегда адаптируем под свои нужны интерфейс - следите за
комментариями:
</p>

<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">&#1048;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;</span>
(setq transient-mark-mode '1)           <span style="color: #b22222;">;; </span><span style="color: #b22222;">Show marked text</span>
(setq font-lock-maximum-decoration t)   <span style="color: #b22222;">;;</span>
(set-scroll-bar-mode 'right)            <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#1055;&#1086;&#1083;&#1086;&#1089;&#1072; &#1087;&#1088;&#1086;&#1082;&#1088;&#1091;&#1090;&#1082;&#1080; &#1089;&#1087;&#1088;&#1072;&#1074;&#1072;</span>
(setq inhibit-startup-message t)        <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#1053;&#1077; &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1080; &#1089;&#1090;&#1072;&#1088;&#1090;&#1077;</span>
(fset 'yes-or-no-p 'y-or-n-p)       <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#1085;&#1077; &#1079;&#1072;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1081;&#1090;&#1077; &#1084;&#1077;&#1085;&#1103; &#1087;&#1077;&#1095;&#1072;&#1090;&#1100; "yes" &#1094;&#1077;&#1083;&#1080;&#1082;&#1086;&#1084;</span>
(setq default-tab-width 4)              <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1090;&#1072;&#1073;&#1091;&#1083;&#1103;&#1094;&#1080;&#1080;</span>
(setq-default indent-tabs-mode nil)     <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#1086;&#1090;&#1089;&#1090;&#1091;&#1087; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1088;&#1086;&#1073;&#1077;&#1083;&#1072;&#1084;&#1080;</span>
(setq initial-scratch-message nil)      <span style="color: #b22222;">;; </span><span style="color: #b22222;">Scratch buffer settings. &#1054;&#1095;&#1080;&#1097;&#1072;&#1077;&#1084; &#1077;&#1075;&#1086;.</span>
(setq scroll-conservatively 50)         <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#1075;&#1083;&#1072;&#1076;&#1082;&#1080;&#1081; &#1089;&#1082;&#1088;&#1086;&#1083;&#1083;&#1080;&#1085;&#1075; &#1089; &#1087;&#1086;&#1083;&#1103;&#1084;&#1080;</span>
(setq scroll-preserve-screen-position 't)
(setq scroll-margin 10)
(setq column-number-mode t)             <span style="color: #b22222;">;; </span><span style="color: #b22222;">show column &amp; line numbers in status bar</span>
(setq line-number-mode t)
(setq my-author-name (getenv <span style="color: #8b2252;">"USER"</span>))
(setq user-full-name (getenv <span style="color: #8b2252;">"USER"</span>))
(recentf-mode 1)                        <span style="color: #b22222;">;; </span><span style="color: #b22222;">Recent files in menu</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">&#1084;&#1099;&#1096;&#1082;&#1072;...</span>
(global-set-key [vertical-scroll-bar down-mouse-1] 'scroll-bar-drag)
                                    <span style="color: #b22222;">;; </span><span style="color: #b22222;">Scroll Bar gets dragged by mouse butn 1</span>
(setq mouse-yank-at-point 't)       <span style="color: #b22222;">;; </span><span style="color: #b22222;">Paste at point NOT at cursor</span>
(mouse-wheel-mode 1)            <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#1082;&#1086;&#1083;&#1077;&#1089;&#1086; &#1084;&#1099;&#1096;&#1082;&#1080;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15">uniquify</h2>
<div class="outline-text-2" id="text-15">
<p>
Я выбрал uniquify - маленькую библитечку, распространяемую вместе с
Емаксом (то есть качать ничего не надо), которая улучшает способ
работы Емакса с буферами, которые отображают файлы с одинаковыми
именами. Более подробную информацию о ней можно посмотреть на
emacswiki.org: <a href="http://emacswiki.org/emacs/uniquify">http://emacswiki.org/emacs/uniquify</a>
</p>

<p>
По умолчанию, Емакс отображает (в списке буферов) такие буферы как
filename, filename&lt;2&gt;, filename&lt;3&gt; и так далее. А uniquify отображает
в имени буфера кусок различающегося пути: filename/folger1,
filename/folger2 etc, что несомненно удобнее.
</p>

<p>
Итак чтобы подключить uniquify вы должны вставить в свой
~/.emacs.d/init.el следующий код:
</p>

<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">http://emacswiki.org/emacs/uniquify</span>
(<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">uniquify</span>)
<span style="color: #b22222;">;; </span><span style="color: #b22222;">(setq uniquify-buffer-name-style t)</span>
(setq uniquify-buffer-name-style 'reverse)
(setq uniquify-separator <span style="color: #8b2252;">"/"</span>)
(setq uniquify-after-kill-buffer-p t)
(setq uniquify-ignore-buffers-re <span style="color: #8b2252;">"^\\*"</span>)
(setq post-forward-angle-brackets 'post-forward-angle-brackets)
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
